In [2]:
import pandas as pd
import numpy as np

In [ ]:
# 1. Create a Datatime index containing all the weekdays days of year 2019 and 
#    assign a random number to each of them in a dataframe.

In [3]:
# 2.  Given Pandas series , height = [23,42,55] and weight = [71,32,48] .
#.    Create a dataframe with height and weight as column names.

In [5]:
height = [23, 42, 55]
weight = [71, 32, 48]

height_series = pd.Series(height)
weight_series = pd.Series(weight)

data = {'height': height, 'weight': weight}

result = pd.DataFrame(data)

print(result)

   height  weight
0      23      71
1      42      32
2      55      48

In [7]:
# 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.

# ser1 = pd.Series([2,3,4,5])
# ser2 = pd.Series([5, 6, 7, 8])

In [19]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5, 6, 7, 8])

arr = ser2.tolist()

for i in arr:

[5, 6, 7, 8]

In [5]:
# Questions on Titanic Dataset :-

In [85]:
df = pd.read_csv("data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [20]:
min_age = df['Age'].min()
print("Minimum age: ",min_age)

max_age = df['Age'].max()
print("Maximum age: ",max_age)

median_age = df['Age'].median()
print("Median age: ",median_age)

age_25_percentile = df['Age'].quantile(0.25)
print("25th Percentile: ", age_25_percentile)

age_75_percentile = df['Age'].quantile(0.75)
print("75th Percentile: ", age_75_percentile)

Minimum age:  0.42
Maximum age:  80.0
Median age:  29.69911764705882
25th Percentile:  22.0
75th Percentile:  35.0

In [16]:
df['Age'].describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [26]:
# 5. How to get frequency counts of unique items of a series? 
#  Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
# SibSp - Number of Siblings/Spouses Aboard.

In [27]:
# pandas.Series.value_counts : Return a Series containing counts of unique values.
unique_sibsp = df['SibSp'].value_counts()
print("frequency counts of ‘SibSp’ column: ", unique_sibsp)

frequency counts of ‘SibSp’ column:  0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [28]:
# 6. Keep only top 2 most frequent values as it is and 
#   replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

# Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [31]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [52]:
# As seen above, S and C are the two most frequent values, replacing C with Other
frequent_embarked_values = ['S', 'C']

filter = df['Embarked'].isin(frequent_embarked_values)
df['Embarked'] = df['Embarked'].where(filter, 'Others') # Where cond is True, keep the original value. Where False, replace with corresponding value from other.

df['Embarked'].value_counts()

S         644
C         168
Others     79
Name: Embarked, dtype: int64

In [53]:
# 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [57]:
df['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [86]:
df['Fare'] = pd.cut(df['Fare'], 5, right=False)

print('Bins: ',df['Fare'].unique())

print('Fare count by bins: ', df['Fare'].value_counts())

Bins:  [[0.0, 102.466), [204.932, 307.398), [102.466, 204.932), [409.863, 512.842)]
Categories (4, interval[float64]): [[0.0, 102.466) < [102.466, 204.932) < [204.932, 307.398) < [409.863, 512.842)]
Fare count by bins:  [0.0, 102.466)        838
[102.466, 204.932)     33
[204.932, 307.398)     17
[409.863, 512.842)      3
[307.398, 409.863)      0
Name: Fare, dtype: int64

In [87]:
# 8. Count the number of missing values in each column?

In [90]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [91]:
# 9. Get the row number of the 5th largest value in the Age column of titanic dataset?

In [99]:
df.nlargest(5, ['Age'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,"[0.0, 102.466)",A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,"[0.0, 102.466)",NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,"[0.0, 102.466)",A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,"[0.0, 102.466)",NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,"[0.0, 102.466)",NaN,Q

In [100]:
df.nlargest(5, ['Age']).index[4]

116

In [101]:
# 10. Normalize all columns in a dataframe?

In [103]:
#df = (df - df.min()) / (df.max() - df.min())

In [105]:
# 11. Get the indices of items of ser2 in ser1 as a list.

# ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
# ser2 = pd.Series([1, 3, 10, 13])

In [1]:
# 12. How to convert a series of date-strings to a timeseries?

In [6]:
data = ["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05","2015-06-06T12:20"]
ser1 = pd.Series(data)
date = pd.to_datetime(ser1)
print(date)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [7]:
# 13. Get the day of month, week number, day of year and day of week from ser.

In [12]:
data = pd.Series(["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05","2015-06-06T12:20"])
data = pd.to_datetime(data)
df = pd.DataFrame({'date': data})
df['week_number'] = df['date'].dt.strftime('%U')
df['day_of_year'] = df['date'].apply(lambda x: x.dayofyear)
df['day_of_week'] = df['date'].apply(lambda x: x.dayofweek)
df.head(6)

                 date week_number  day_of_year  day_of_week
0 2010-01-01 00:00:00          00            1            4
1 2011-02-02 00:00:00          05           33            2
2 2012-03-03 00:00:00          09           63            5
3 2013-04-04 00:00:00          13           94            3
4 2014-05-05 00:00:00          18          125            0
5 2015-06-06 12:20:00          22          157            5

In [13]:
# 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [14]:
import math
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
'''
euclidean distance
dist((x, y), (a, b)) = √(x - a)² + (y - b)²
'''
dist = math.sqrt(sum((p - q) ** 2))
print(dist)

18.16590212458495

In [15]:
# 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [20]:
from pandas.tseries.offsets import BusinessDay

isBusinessDay = BusinessDay().onOffset
date = pd.Series(pd.date_range('2000-01-01', periods=100, freq= 'D'))
match_series = pd.to_datetime(date).map(isBusinessDay)
date1  = date[~match_series][:10]

print(date1)

0    2000-01-01
1    2000-01-02
7    2000-01-08
8    2000-01-09
14   2000-01-15
15   2000-01-16
21   2000-01-22
22   2000-01-23
28   2000-01-29
29   2000-01-30
dtype: datetime64[ns]

In [21]:
# 16. Import every 50th row of BostonHousing dataset as a dataframe.

In [28]:
df_boston = pd.read_csv('data/boston_house_price.csv')

In [29]:
df_50th_row = df_boston.iloc[::50, :]
df_50th_row

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8